# Напишите функцию f, которая на вход принимает два числа a и b,
# и возводит число a в целую степень b с помощью рекурсии.
# Функция не должна ничего выводить, только возвращать значение.

def f(a_1, b_1):
    return a_1**b_1

a_1 = 2
b_1 = 2
print(f(a_1, b_1))


